#include <iostream>

int main()
{
	setlocale(LC_ALL, "Russian"); // Заставляем консоль выводить русский текст

	//(#1#)
	short fst, scn;
	printf("Введите значения для A и B:\n");
	std::cin >> fst >> scn; // Запрашиваем значения двух целых чисел
	if (fst > scn)
	{
		printf("Число A больше чем B, введите целое значение для С:\n"); // Первое число оказалось больше второго, запрашиваем третье
		short thr;
		std::cin >> thr;

		if (thr > fst && thr > scn) // Третье наибольшее
		{
			printf("Синий");
		}
		else // Третье наименьшее, либо меньше одного из двух, либо равно одному из двух
		{
			printf("Зеленый\n\n");
		}
	}
	else // Второе оказалось больше первого, либо они равны
	{
		printf("Ракета\n\n");
	}

	//(#2#)
	short N;
	printf("Введите номер рейсового автобуса, чей маршрут хотите проверить (113, 114, 117, 118, 119, 125, 136, 141, 148, 161, 191, 593, 802):\n");
	std::cin >> N; // Запрашиваем номер рейсового автобуса
	switch (N)
	{
	case 114:
	case 141:
		printf("Маршрут этого автобуса: Калининград - Зеленоградск\n"); // Автобусы, которые идут в Зеленоградск
		break;
	case 148:
	case 191:
		printf("Маршрут этого автобуса: Калининград - Багратионовск\n"); // Автобусы, которые идут в Багратионовск
		break;
	case 113:
		printf("Маршрут этого автобуса: Калининград - Чапаево\n");
		break;
	case 117:
		printf("Маршрут этого автобуса: Калининград - Мамоново\n");
		break;
	case 118:
		printf("Маршрут этого автобуса: Калининград - Светлогорск\n");
		break;
	case 119:
		printf("Маршрут этого автобуса: Калининград - Пионерский\n");
		break;
	case 125:
		printf("Маршрут этого автобуса: Калининград - Донское\n");
		break;
	case 136:
		printf("Маршрут этого автобуса: Калининград - Партизанское\n");
		break;
	case 161:
		printf("Маршрут этого автобуса: Калининград - Светлое\n");
		break;
	case 593:
		printf("Маршрут этого автобуса: Калининград - Морское\n");
		break;
	case 802:
		printf("Маршрут этого автобуса: Калининград - Гданьск\n");
		break;
	// ^^^ Автобусы, которые не идут ни в Зеленоградск, ни в Багратионовск ^^^

	default:
		printf("Автобуса с таким номером не существует!\n");
		break;
	// Ошибка при вводе номера автобуса
	}
}
// Янин Трофим, 1-4, вариант 2