#include <iostream>

int main()
{
	setlocale(LC_ALL, "Russian");

	// (#1#)

	char ans; // ответ
	float sum = 0, mini = 0; // сумма и минимум
	bool ifmin = false; // флаг, найден ли минимум

	printf("Вы знаете кол-во членов последовательности? Y/N\n");
	std::cin >> ans; // спрашиваем, знает ли пользователь кол-во членов последовательности

	if (ans == 'Y' || ans == 'y') // обрабатываем положительный ответ
	{
		int num; // кол-во членов последовательности
		printf("Введите кол-во членов последовательности:\n\n");
		std::cin >> num;
		for (int i = 0; i < num; i++) // тк мы знаем кол-во шагов, используем цикл for(). Начинаем с нуля, с каждым шагом прибавляем 1, выходим как только шаги сравняются с кол-вом членов
		{
			float x; // член последовательности
			printf("Введите член последовательности:\n");
			std::cin >> x; // запрашиваем каждый член последовательности
			if (not(x >= 1 && x < 13.2)) // проверяем, не находится ли член в пределах [1; 13.2]
			{
				continue; // если не находится, пропускаем шаг
			}
			sum += x; // к конечной сумме прибавляем каждый член последовательности
			if (ifmin == false || x < mini) // проверяем, не найдено ли минимальное значение
			{
				mini = x;
				ifmin = true;
				// проверяем, находится ли член последовательности в пределе. если да, находим минимум.
				//	если минимума нет, первый подходящий член последовательности записывается как минимум, без сравнения. флаг ifmin меняется на true, тк минимум найден.
				//   если минимум уже есть, сравниваем минимум с текущим членом последовательности, меньший записываем как минимум.
			}
		}
	}

	else // обрбатываем отрицательный ответ
	{
		float x; // член последовательности
		printf("Кол-во членов последовательности неизвестно, вводите числа. 0 - конец последовательности\n");
		std::cin >> x;
		while (x != 0)
		{
			if (not(x >= 1 && x < 13.2)) // проверяем, не находится ли член в пределах [1; 13.2]
			{
				continue; // если не находится, пропускаем шаг
			}
			sum += x;
			if (ifmin == false || x < mini)
			{
				mini = x;
				ifmin = true;
			}
		}
	}

	if (ifmin == true)
	{
		printf("Сумма: %f\nМинимум: %f\n", sum, mini);
	}
	else
	{
		printf("Ни одно из введеных чисел не не попало в предел [1; 13,2)\n");
	}
}
// Янин Трофим, 1-4, вариант 2