#include <iostream>
#include <bitset> // Загружаем библиотеки (дополнительно можно загрузить cmath, если функция pow() не работает)

int scnd() // Функция для второго задания
{
	std::bitset<8> d(short(25)), f(short(19)); // Задаем переменные прямо внутри bitset<>
	short i; // Задаем на будущее номер бита
	std::cout << "(#2#)\nD = 25, битовая цепочка D: " << d << "\nF = 19, битовая цепочка F: " << f; // Выводим значения переменных в консоль
	std::cout << "\nПо действиям:\n1) F<<2 = " << (f << 2) << "\n2) (F | (F<<2)) = " << (f | (f << 2)) << "\n3) (F | (F<<2)) & D = " << ((f | (f << 2)) & d); // Выводим результат 2.1

	printf("\n\nКакое значение i бита (D>>3) показать? Значение должно находится в диапазоне от 0 до 7.\n");
	std::cin >> i; // Запрашиваем у пользователя значение i бита, считываем его с клавиатуры
	std::cout << "Битовая цепочка D>>3: " << (d >> 3) << "\nЗначение бита i: " << (d >> 3)[i] << std::endl; // Выводим результат 2.2

	return 0;
}

int main() // Главная функция для первого задания
{
	setlocale(LC_ALL, "Russian"); // Заставляем консоль выводить русский текст
	float a, b; // Задаем переменные для выражения
	std::cout << "(#1#)\nВведите значение для чисел A и B: \n";
	std::cin >> a >> b;  // Считываем их с клавиатуры
	float c = pow(a, 2) + 2 * pow(b, 0.5); // Вычисляем значение С по формуле ниже
	printf("Значение A: %.2f\nЗначение B: %.2f\nЗначение С по формуле (C = A^2 + 2 * sqrt(B)) равно: %.2f\n\n", a, b, c); // Выводим результат в консоли
	scnd(); // Вызываем функцию для второго задания
}
// Янин Трофим, 1-4, вариант 2