#include <iostream>
#include <Windows.h> // Импортируем библиотеки

int main()
{
	SetConsoleCP(1251);	// Заставляем консоль правильно считывать русский язык
	setlocale(LC_ALL, "Russian"); // Заставляем консоль правильно выводить русский язык
	float a; // Вес бегемота (кг и гр)
	unsigned short b; // Кол-во арбузов
	char c; // Пол бегемота (м/ж)

	std::cin >> a >> b >> c; // Вводим вес бегемота, кол-во арбузов и пол

	std::cout << "Бегемот Арси весит " << a << " кг., съедает " << b << " арбузов в день и по документам " << c << std::endl;
}
//Янин Трофим, 1-4, вариант 3