#include <iostream>

int main()
{
	setlocale(LC_ALL, "Russian");

	// (#1#)

	char ans; // ответ
	float sum = 0, mini = 0; // сумма и минимум
	bool ifmin = false; // флаг, найден ли минимум
	
	printf("Количество членов последовательности известно? Y/N\n");
	std::cin >> ans;

	if (ans == 'Y' || ans == 'y') // обрабатываем положительный результат
	{
		unsigned short num; // кол-во членов последовательности
		printf("Введите количество членов последовательности:\n");
		std::cin >> num;
		for (unsigned short i = 0; i < num; i++) // тк мы знаем кол-во членов последовательности (кол-во шагов), используем цикл for()
		// начинаем с нуля, с каждым шагом прибавляем по единице. выходим сразу, как только шаг станет равен кол-ву членов последовательности
		{
			float x; // Член последовательности
			printf("Введите член последовательности:\n");
			std::cin >> x;
			if (not(x >= 1 && x < 13.2))
			{
				continue; // если член последовательности не удовлетворяет условию, пропускаем его
			}
			sum += x;
			if (ifmin == false || x < mini); // проверяем минимум
			{
				mini = x;
				ifmin = true;
				// если минимум не найден, первый подходящий член последовательности записываем в минимум
				//  если минимум найден, проверяем его с членом последовательности, наименьшее записываем как минимум
				//   тк минимум найден, флаг ifmin меняем на true
			}
		}
	}
	else // обрабатываем отрицательный результат
	{
		float x; // Член последовательности
		printf("Вводите члены последовательности. 0 - конец последовательности.\n");
		std::cin >> x;
		while (x != 0) // кол-во членов последовательности неизвестно, используем while()
		{
			if (x >= 1 && x < 13.2) // если использовать not(x >= 1 && x < 13.2), а после continue (как в первом случае), произойдет зависание
			{
				sum += x;
				if (ifmin == false || x < mini)
				{
					mini = x;
					ifmin = true;
				}
			}
			std::cin >> x; // вводим следующий член последовательности
		}
	}

	if (ifmin)
	{
		printf("Сумма: %.2f\nМинимум: %.2f\n", sum, mini);
	}
	else
	{
		printf("Ни один из членов последовательности не удовлетворяет условию!\n");
	}

//###########################################################################################################################################################//

	// (#2#)
}
// Янин Трофим, 1-4, вариант 2