#include <iostream>
#include <bitset> // Загружаем библиотеки (дополнительно можно загрузить cmath, если функция pow() не работает)

int main() // Главная функция для первого задания
{
	setlocale(LC_ALL, "Russian"); // Заставляем консоль выводить русский текст
	float a, b; // Задаем переменные для выражения
	std::cout << "(#1#)\nВведите значение для чисел A и B: \n";
	std::cin >> a >> b;  // Считываем их с клавиатуры
	float c = pow(a, 2) + 2 * pow(b, 0.5); // Вычисляем значение С по формуле ниже
	printf("Значение A: %.2f\nЗначение B: %.2f\nЗначение С по формуле (C = A^2 + 2 * sqrt(B)) равно: %.2f\n\n", a, b, c); // Выводим результат в консоли

	short d = 25, f = 19; // Задаем переменную D и F
	std::bitset<8> bitsd(d), bitsf(f); // Отдельно задаем переменную bitsd и bitsf, чтобы хранить битовое значение D и F, для удобства дальнейших вычислений
	short i; // Задаем на будущее номер бита
	std::cout << "(#2#)\nD = " << d << ", битовая цепочка D: " << bitsd << "\nF = " << f << ", битовая цепочка F: " << bitsf; // Выводим битовые значения переменных в консоль
	std::cout << "\nПо действиям:\n1) F<<2 = " << (bitsf << 2) << "\n2) (F | (F<<2)) = " << (bitsf | (bitsf << 2)) << "\n3) (F | (F<<2)) & D = " << ((bitsf | (bitsf << 2)) & bitsd); // Выводим результат 2.1

	printf("\n\nКакое значение i бита (D>>3) показать?\n");
	std::cin >> i; // Запрашиваем у пользователя значение i бита, считываем его с клавиатуры
	std::cout << "Битовая цепочка D>>3: " << (bitsd >> 3) << "\nЗначение бита i: " << (((d >> 3) >> i) % 2) << std::endl; // Выводим результат 2.2
	// . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .^ чтобы достать i-бит, сдвигаем d>>3 на i, чтобы нужный бит оказался справа,
	// . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . именно по этому мы просим пользователя вводить значения от 0 до 7.
	// . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . Берем остаток от деления на 2, именно из переменной d>>3, 
	// . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . потому что на битовую цепочку нельзя применить оператор % (остаток от деления).
	// . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . В данном примере, при сдвиге d>>3, 25 уменьшается до 3 (00000011).
	// . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . Если i = 1, 00000011 сдвигается на 1 вправо, 00000001 = 1.
	// . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . Делим: 1%2 = 1, значит, i-бит равен 1.
}
// Янин Трофим, 1-4, вариант 2